const collegeMap = {
  1: {
    name: "大数据系统计算技术国家工程实验室",
    majors: {
      101: "计算机科学与技术（IEEE荣誉班）",
    }
  },
  2: {
    name: "高等研究院",
    majors: {
      201: "理工创新实验班",
    }
  },
  3: {
    name: "金融科技学院",
    majors: {
      301: "金融科技",
      302: "金融科技（中外合作办学）",
      303: "电子商务（中外合作办学）",
      304: "信息管理与信息系统（中外合作办学）"
    }
  },
  4: {
    name: "材料学院",
    majors: {
      401: "材料科学与工程",
      402: "高分子材料与工程"
    }
  },
  5: {
    name: "传播学院",
    majors: {
      501: "广告学（含卓越班）",
      502: "新闻学",
      503: "网络与新媒体"
    }
  },
  6: {
    name: "电子与信息工程学院",
    majors: {
      601: "电子信息工程（文华班）",
      602: "电子信息工程",
      603: "通信工程",
      604: "电子科学与技术",
      605: "微电子科学与工程"
    }
  },
  7: {
    name: "法学院",
    majors: {
      701: "法学",
    }
  },
  8: {
    name: "管理学院",
    majors: {
      801: "工商管理",
      802: "信息管理与信息系统",
      803: "人力资源管理",
      804: "市场营销",
      805: "电子商务"
    }
  },
  9: {
    name: "化学与环境工程学院",
    majors: {
      901: "化学、化学（师范）",
      902: "环境工程",
      903: "新能源科学与工程",
      904: "食品科学与工程"
    }
  },
  10: {
    name: "机电与控制工程学院",
    majors: {
      1001: "机械设计制造及其自动化",
      1002: "自动化",
      1003: "机器人工程"
    }
  },
  11: {
    name: "计算机与软件学院",
    majors: {
      1101: "计算机科学与技术",
      1102: "软件工程",
      1103: "人工智能"
    }
  },
  12: {
    name: "建筑与城市规划学院",
    majors: {
      1201: "建筑学",
      1202: "城乡规划",
      1203: "风景园林",
      1204: "地理空间信息工程（智慧城市）"
    }
  },
  13: {
    name: "教育学部",
    majors: {
      1301: "教育技术学（智能教育）（师范）",
      1302: "学前教育（师范）",
    }
  },
  14: {
    name: "经济学院",
    majors: {
      1401: "金融学",
      1402: "供应链管理",
      1403: "会计学",
      1404: "国际经济与贸易",
      1405: "经济学",
      1406: "金融学(创新班)"
    }
  },
  15: {
    name: "人文学院",
    majors: {
      1501: "汉语言文学（师范）",
      1502: "汉语言文学（含卓越班）",
      1503: "汉语国际教育（师范）",
      1504: "历史学",
      1505: "国学精英班（校内二次选拔）",
    }
  },
  16: {
    name: "生命与海洋科学学院",
    majors: {
      1601: "生物科学（含卓越班）",
      1602: "生物技术",
      1603: "海洋科学",
      1604: "生物科学（师范）"
    }
  },
  17: {
    name: "数学科学学院",
    majors: {
      1701: "数学与应用数学",
      1702: "数学与应用数学（师范）",
      1703: "信息与计算科学",
      1704: "统计学"
    }
  },
  18: {
    name: "体育学院",
    majors: {
      1801: "体育教育（师范）",
      1802: "运动训练",
      1803: "休闲体育（休闲旅游）",
      1804: "休闲体育（高尔夫）"
    }
  },
  19: {
    name: "土木与交通工程学院",
    majors: {
      1901: "智能建造",
      1902: "土木工程",
      1903: "工程管理",
      1904: "智慧交通"
    }
  },
  20: {
    name: "外国语学院",
    majors: {
      2001: "英语",
      2002: "日语",
      2003: "法语（法英）",
      2004: "德语（德英）",
      2005: "西班牙语"
    }
  },
  21: {
    name: "物理与光电工程学院",
    majors: {
      2101: "光电信息科学与工程",
      2102: "测控技术与仪器",
      2103: "物理学",
      2104: "物理学（师范）",
      2105: "核工程与核技术"
    }
  },
  22: {
    name: "心理学院",
    majors: {
      2201: "心理学",
    }
  },
  23: {
    name: "医学部",
    majors: {
      2301: "临床医学（含卓越班）",
      2302: "生物医学工程（含医疗科创卓越班）",
      2303: "药学",
      2304: "口腔医学",
      2305: "预防医学"
    }
  },
  24: {
    name: "艺术学部",
    majors: {
      2401: "音乐表演、音乐学（师范）",
      2402: "舞蹈编导",
      2403: "流行演唱、流行器乐演奏",
      2404: "播音与主持艺术",
      2405: "表演（影视戏剧）",
      2406: "设计学、美术学"
    }
  },
  25: {
    name: "政府管理学院",
    majors: {
      2501: "行政管理",
      2502: "社会学"
    }
  }
};

module.exports = collegeMap;
